//Detects actions indicating that someone access workspace keys
AzureActivity
| where OperationNameValue == "MICROSOFT.OPERATIONALINSIGHTS/WORKSPACES/SHAREDKEYS/ACTION"
| where ActivityStatusValue == "Success"
| extend WorkspaceName = tostring(parse_json(Properties).resource)
| project
    TimeGenerated,
    Caller,
    WorkspaceName,
    CallerIpAddress,
    SubscriptionId,
    ResourceGroup,
    _ResourceId
