AzureActivity
| where ResourceProviderValue == "MICROSOFT.NETWORK"
| where OperationNameValue in ("MICROSOFT.NETWORK/FIREWALLPOLICIES/DELETE", "MICROSOFT.NETWORK/AZUREFIREWALLS/DELETE", "MICROSOFT.NETWORK/VIRTUALNETWORKGATEWAYS/DELETE")
| where ActivityStatusValue == "Success"
| extend Resource = tostring(Properties_d.resource)
| project
    TimeGenerated,
    SubscriptionId,
    ResourceGroup,
    Resource,
    OperationNameValue,
    Caller,
    CallerIpAddress,
    _ResourceId
