// Detects KeyVault deletions from Subscription audits
AzureActivity
| where OperationNameValue =~ "Microsoft.RecoveryServices/vaults/delete"
| where ActivityStatus == "Succeeded"
| project CallerIpAddress, Caller, ResourceId
