let TimeFrame = 10m;
let ChangesThreshold = 5;
SecurityEvent
| where EventID == "4723" or EventID == "4724"
| where AccountType == "User"
| where TargetUserName !endswith "$"
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), TotalChanges = count() by SubjectUserName
| where TotalChanges >= ChangesThreshold
